LESSA/Win32/soap_rq_unicode.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://soap/encoding/" xmlns:SOAP-ENC="http://soap/encoding/" xmlns:SOAP-ENV="http://soap/envelope/" xmlns:xsd="http://1999/XMLSchema" xmlns:xsi="http://1999/XMLSchema-instance">
   <SOAP-ENV:Body>
    <m:getStateName xmlns:m="http://www.soapware.org/">
      <statenum xsi:type="xsd:int">41</statenum>
    </m:getStateName>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>